{
  "fwdSensors": "Blocs pour les composants du senseur du Kit d'Action pour le Climat Enveloppe pour l'encodeur rotatif FWD Edu, également connu sous le nom de \"roue\" Le nombre de pas constituant un tour complet de la roue Exécuter le code lorsque la roue est tourné dans une direction spécifique. Choisir entre le sens horaire et le sens antihoraire. La position absolue de la roue depuis sa dernière connexion.\nLes nombres positifs sont dans le sens des aiguilles d’une montre, les négatifs dans le sens contraire des aiguilles d’une montre. Zéro est la position de départ.\nCe nombre reflète la somme de tous les mouvements, donc trois pas dans le sens horaire suivis de cinq dans le sens antihoraire donneront -1 (inclut zéro comme une position). Retourne le niveau de luminosité de l'anneau, de 0 à 10. Retourne le nombre de lumières composant un anneau LED Tourner le patron de lumière vers la gauche ou la droite, en emballant le dernier pixel au premier Le nombre de positions qui vont tourner. Les nombres positifs sont dans le sens des aiguilles d’une montre, les négatifs dans le sens contraire des aiguilles d’une montre. Établir toutes les LEDs sur une couleurnTOUT: réparer le sélecteur de couleur valeur de couleur en utilisant soit le sélecteur de couleur des blocs soit la valeur hexadécimale Régler la luminosité de l'anneau LED Établir une LED spécifique sur une couleur\n\n\nTOUT : corrige le sélecteur de couleur le numéro de LED valeur de couleur en utilisant soit le sélecteur de couleur des blocs soit la valeur hexadécimale Déplacer le patron de lumière vers la gauche ou la droite. Si le patron de lumière est déplacé au-delà de la première ou de la dernière lumière, cette partie du patron est supprimée Le nombre de positions qui vont être changées. Les nombres positifs sont dans le sens des aiguilles d’une montre, les négatifs dans le sens contraire des aiguilles d’une montre. Vérifie un état spécifique du senseur de ligne ○ (rater) ou ● (frapper) Rétorune si le senseur de ligne détecte ou non une réflexion Exécute le code lorsque le senseur passe d'un état à un autre. Exécute le code lorsque le niveau d'humidité dépasse ou descend en dessous d'une limite établie S'exécuter lorsque le niveau est au-dessus ou en dessous de la limite établie quel niveau d’humidité indique la coupe avant d’exécuter le code Retourne le niveau d'humidité du senseur sous forme d'un nombre entre 0 et 100 Exécute le code lorsque le niveau d'humidité change de plus d'une certaine quantité entre les lectures. combien de pourcentage deux lectures doivent-elles différer avant que le code s'exécute Exécute le code lorsque le niveau de lumière dépasse ou descend en dessous d'une limite établie exécuter lorsque le niveau est au-dessus ou en dessous de la limite établie À quel niveau de lumière la limite est-elle atteinte avant que le code s'exécute Retourne le niveau de lumière du senseur sous forme d'un nombre entre 0 et 100 Exécute le code lorsque le niveau de lumière change de plus d'une certaine quantité entre les lectures. de combien de pourcentage deux lectures doivent-elles différer avant que le code ne s'exécute Retourne la lecture de distance du senseur en mètres Exécute le code lorsque la distance dépasse ou descend en dessous d'une limite établie S'exécute lorsque la distance est supérieure ou inférieure de la limite établie À quelle distance est la limite avant que le code s'exécute Exécute le code lorsque la distance change de plus d'une certaine quantité entre les lectures combien de pourcentage deux lectures doivent-elles différer avant que le code s'exécute Retourne la durée en ms de la dernière pulsation sur le bouton en ms retourne le vrai si le bouton est actuellement enfoncé, sinon il est faux Code à exécuter lorsqu'un événement choisi se produit Bouton appuyé (bas), maintenu, relâché (en haut)",
  "fwdSensors.FwdDialClient": "Enveloppe pour l'encodeur rotatif FWD Edu, également connu sous le nom de \"roue\" Le nombre de pas constituant un tour complet de la roue Exécuter le code lorsque la roue est tourné dans une direction spécifique. Choisir entre le sens horaire et le sens antihoraire. La position absolue de la roue depuis sa dernière connexion.\nLes nombres positifs sont dans le sens des aiguilles d’une montre, les négatifs dans le sens contraire des aiguilles d’une montre. Zéro est la position de départ.\nCe nombre reflète la somme de tous les mouvements, donc trois pas dans le sens horaire suivis de cinq dans le sens antihoraire donneront -1 (inclut zéro comme une position).",
  "fwdSensors.FwdDialClient.fwdClicksPerTurn": "Le nombre de pas constituant un tour complet de la roue",
  "fwdSensors.FwdDialClient.fwdOnDialTurned": "Exécuter le code lorsque la roue est tourné dans une direction spécifique. Choisir entre le sens horaire et le sens antihoraire.",
  "fwdSensors.FwdDialClient.fwdOnDialTurned|param|direction": "Choisir entre le sens horaire et le sens antihoraire.",
  "fwdSensors.FwdDialClient.fwdPosition": "La position absolue de la roue depuis sa dernière connexion.\nLes nombres positifs sont dans le sens des aiguilles d’une montre, les négatifs dans le sens contraire des aiguilles d’une montre. Zéro est la position de départ.\nCe nombre reflète la somme de tous les mouvements, donc trois pas dans le sens horaire suivis de cinq dans le sens antihoraire donneront -1 (inclut zéro comme une position)."
}
