{
  "fwdSensors": "Bloques para los componentes de los sensores del Kit de Acción por el Clima Envoltura para codificador rotativo FWD Edu, también conocido como \"rueda\" El número de pasos que componen una vuelta completa del selector Ejecutar el código cuando el selector se gira en una dirección específica Elegir entre el sentido de las agujas del reloj y el sentido contrario a las agujas del reloj La posición absoluta del selector desde la última vez que se conectó.\nLos números positivos son en el sentido de las agujas del reloj, los negativos en el sentido contrario a las agujas del reloj. Cero es la posición inicial.\nEste número refleja la suma de todos los movimientos, por lo que tres pasos en el sentido de las agujas del reloj seguidos de cinco en el sentido contrario a las agujas del reloj leerán -1 (incluye cero como posición) Devuelve el nivel de brillo del anillo, 0-10 Devuelve el número de luces que componen un anillo LED Girar el patrón de luz hacia la izquierda o hacia la derecha, envolviendo el último píxel al primero El número de posiciones que se van a rotar. Los números positivos están en el sentido de las agujas del reloj, los números negativos en el sentido contrario a las agujas del reloj Establecer todos los LED en un colornnTODO: arreglar el selector de color valor del color utilizando el selector de color de bloques o el valor hexadecimal Ajustar el brillo del anillo LED Establecer un LED específico en un color\n\n\nTODO: corrige el selector de color el número de LED valor de color utilizando el selector de color de bloques o el valor hexadecimal Mover el patrón de luz hacia la izquierda o hacia la derecha. Si el patrón de luz se desplaza más allá de la primera o la última luz, esa parte del patrón se elimina. El número de posiciones que se van a cambiar. Los positivos están en el sentido de las agujas del reloj, los negativos en el sentido contrario a las agujas del reloj Verifica el estado de un sensor de línea específico ○ (fallar) o ● (golpear) Devuelve si el sensor de línea está detectando o no un reflejo Ejecuta un código cuando el sensor cambia de un estado a otro Ejecuta el código cuando el nivel de humedad supera o baja un límite establecido Ejecutarse cuando el nivel está por encima o por debajo del límite establecido cuál nivel de humedad indica el corte antes de ejecutar el código Devuelve el nivel de humedad del sensor como un número entre 0 y 100 Ejecuta el código cuando el nivel de humedad cambia en más de una cierta cantidad entre lecturas cuánto por ciento tienen que diferir dos lecturas antes de que se ejecute el código Ejecuta el código cuando el nivel de luz está por encima o por debajo de un límite establecido funcionar cuando el nivel está por encima o por debajo del límite establecido qué nivel de luz hace el corte antes de ejecutar el código Devuelve el nivel de luz del sensor como un número entre 0 y 100 Ejecuta el código cuando el nivel de luz cambia en más de una cierta cantidad entre lecturas cuánto por ciento tienen que diferir dos lecturas antes de que se ejecute el código Devuelve la lectura de distancia del sensor en metros Ejecuta el código cuando la distancia supera o baja un límite establecido Se ejecuta cuando la distancia está por encima o por debajo del límite establecido cuál es la distancia límite antes de ejecutar el código ejecuta el código cuando la distancia cambia en más de una cierta cantidad entre lecturas cuánto por ciento tienen que diferir dos lecturas antes de que se ejecute el código Devuelve la duración en ms de la última pulsación del botón en ms devuelve el verdadero si el botón está presionado actualmente, de lo contrario es falso Código a ejecutar cuando se produzca un evento seleccionado Botón presionado (abajo), sostenido, soltado (arriba)",
  "fwdSensors.FwdDialClient": "Envoltura para codificador rotativo FWD Edu, también conocido como \"rueda\" El número de pasos que componen una vuelta completa del selector Ejecutar el código cuando el selector se gira en una dirección específica Elegir entre el sentido de las agujas del reloj y el sentido contrario a las agujas del reloj La posición absoluta del selector desde la última vez que se conectó.\nLos números positivos son en el sentido de las agujas del reloj, los negativos en el sentido contrario a las agujas del reloj. Cero es la posición inicial.\nEste número refleja la suma de todos los movimientos, por lo que tres pasos en el sentido de las agujas del reloj seguidos de cinco en el sentido contrario a las agujas del reloj leerán -1 (incluye cero como posición)",
  "fwdSensors.FwdDialClient.fwdClicksPerTurn": "El número de pasos que componen una vuelta completa del selector",
  "fwdSensors.FwdDialClient.fwdOnDialTurned": "Ejecutar el código cuando el selector se gira en una dirección específica Elegir entre el sentido de las agujas del reloj y el sentido contrario a las agujas del reloj",
  "fwdSensors.FwdDialClient.fwdOnDialTurned|param|direction": "Elegir entre el sentido de las agujas del reloj y el sentido contrario a las agujas del reloj",
  "fwdSensors.FwdDialClient.fwdPosition": "La posición absoluta del selector desde la última vez que se conectó.\nLos números positivos son en el sentido de las agujas del reloj, los negativos en el sentido contrario a las agujas del reloj. Cero es la posición inicial.\nEste número refleja la suma de todos los movimientos, por lo que tres pasos en el sentido de las agujas del reloj seguidos de cinco en el sentido contrario a las agujas del reloj leerán -1 (incluye cero como posición)"
}
