{
  "fwdSensors.FwdLEDClient.fwdBrightness": "Devuelve el nivel de brillo del anillo, 0-10",
  "fwdSensors.FwdLEDClient.fwdNumPixels": "Devuelve el número de luces que componen un anillo LED",
  "fwdSensors.FwdLEDClient.fwdRotate": "Girar el patrón de luz hacia la izquierda o hacia la derecha, envolviendo el último píxel al primero El número de posiciones que se van a rotar. Los números positivos están en el sentido de las agujas del reloj, los números negativos en el sentido contrario a las agujas del reloj",
  "fwdSensors.FwdLEDClient.fwdRotate|param|offset": "El número de posiciones que se van a rotar. Los números positivos están en el sentido de las agujas del reloj, los números negativos en el sentido contrario a las agujas del reloj",
  "fwdSensors.FwdLEDClient.fwdSetAllPixelsColour": "Establecer todos los LED en un color. Valor del color utilizando el selector de color de bloques o el valor hexadecimal",
  "fwdSensors.FwdLEDClient.fwdSetAllPixelsColour|param|rgb": "valor del color utilizando el selector de color de bloques o el valor hexadecimal",
  "fwdSensors.FwdLEDClient.fwdSetBrightness": "Ajustar el brillo del anillo LED",
  "fwdSensors.FwdLEDClient.fwdSetPixelColour": "Establecer un LED específico en un color. El número de LED valor de color utilizando el selector de color de bloques o el valor hexadecimal",
  "fwdSensors.FwdLEDClient.fwdSetPixelColour|param|index": "el número de LED",
  "fwdSensors.FwdLEDClient.fwdSetPixelColour|param|rgb": "valor de color utilizando el selector de color de bloques o el valor hexadecimal",
  "fwdSensors.FwdLEDClient.fwdShift": "Mover el patrón de luz hacia la izquierda o hacia la derecha. Si el patrón de luz se desplaza más allá de la primera o la última luz, esa parte del patrón se elimina. El número de posiciones que se van a cambiar. Los positivos están en el sentido de las agujas del reloj, los negativos en el sentido contrario a las agujas del reloj",
  "fwdSensors.FwdLEDClient.fwdShift|param|offset": "El número de posiciones que se van a cambiar. Los positivos están en el sentido de las agujas del reloj, los negativos en el sentido contrario a las agujas del reloj"
}
